app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "this is comment #1"], ["commenter", "fusion94"], ["created_at", Thu, 24 Jan 2013 05:14:46 UTC +00:00], ["post_id", 1], ["updated_at", Thu, 24 Jan 2013 05:14:46 UTC +00:00]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1 AND "comments"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
---
  def destroy
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
    @comment.destroy